In [5]:
import pandas as pd
import numpy as np
dates = pd.date_range('1/1/2000', periods=8)

In [7]:
df = pd.DataFrame(np.random.randn(8, 4),
   ...:                   index=dates, columns=['A', 'B', 'C', 'D'])

In [8]:
df

                   A         B         C         D
2000-01-01 -0.104215 -0.006178  0.128062  0.487910
2000-01-02  0.938386 -0.423020 -0.396542  0.171286
2000-01-03  0.626929  0.001200  0.108056  1.691873
2000-01-04  0.056640  0.400470 -1.266217  0.571887
2000-01-05 -0.711993 -0.950226  0.433433 -1.233371
2000-01-06 -1.479888 -0.017285  0.522521 -0.456433
2000-01-07 -0.916996 -0.227449 -0.402383  1.753993
2000-01-08  0.971987 -1.107659 -1.265242 -0.801794

In [11]:
panel = pd.Panel({'one': df, 'two': df - df.mean()})

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3267: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [12]:
s = df['A']

In [14]:
s[dates[5]]

-1.479888378548411

In [15]:
panel['two']

                   A         B         C         D
2000-01-01 -0.026821  0.285090  0.395351  0.214741
2000-01-02  1.015780 -0.131751 -0.129253 -0.101883
2000-01-03  0.704323  0.292468  0.375345  1.418704
2000-01-04  0.134034  0.691738 -0.998928  0.298718
2000-01-05 -0.634599 -0.658958  0.700722 -1.506540
2000-01-06 -1.402495  0.273984  0.789810 -0.729602
2000-01-07 -0.839602  0.063820 -0.135094  1.480824
2000-01-08  1.049381 -0.816391 -0.997953 -1.074962

In [16]:
df[['B', 'A']] = df[['A', 'B']]

In [17]:
df

                   A         B         C         D
2000-01-01 -0.006178 -0.104215  0.128062  0.487910
2000-01-02 -0.423020  0.938386 -0.396542  0.171286
2000-01-03  0.001200  0.626929  0.108056  1.691873
2000-01-04  0.400470  0.056640 -1.266217  0.571887
2000-01-05 -0.950226 -0.711993  0.433433 -1.233371
2000-01-06 -0.017285 -1.479888  0.522521 -0.456433
2000-01-07 -0.227449 -0.916996 -0.402383  1.753993
2000-01-08 -1.107659  0.971987 -1.265242 -0.801794

In [18]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]

In [19]:
df[['A', 'B']]

                   A         B
2000-01-01 -0.006178 -0.104215
2000-01-02 -0.423020  0.938386
2000-01-03  0.001200  0.626929
2000-01-04  0.400470  0.056640
2000-01-05 -0.950226 -0.711993
2000-01-06 -0.017285 -1.479888
2000-01-07 -0.227449 -0.916996
2000-01-08 -1.107659  0.971987

In [21]:
sa = pd.Series([1, 2, 3], index=list('abc'))

In [22]:
sa

a    1
b    2
c    3
dtype: int64

In [23]:
dfa = df.copy()

In [24]:
sa.b

2

In [25]:
panel.one

                   A         B         C         D
2000-01-01 -0.104215 -0.006178  0.128062  0.487910
2000-01-02  0.938386 -0.423020 -0.396542  0.171286
2000-01-03  0.626929  0.001200  0.108056  1.691873
2000-01-04  0.056640  0.400470 -1.266217  0.571887
2000-01-05 -0.711993 -0.950226  0.433433 -1.233371
2000-01-06 -1.479888 -0.017285  0.522521 -0.456433
2000-01-07 -0.916996 -0.227449 -0.402383  1.753993
2000-01-08  0.971987 -1.107659 -1.265242 -0.801794

In [26]:
dfa.A = list(range(len(dfa.index)))

In [27]:
dfa

            A         B         C         D
2000-01-01  0 -0.104215  0.128062  0.487910
2000-01-02  1  0.938386 -0.396542  0.171286
2000-01-03  2  0.626929  0.108056  1.691873
2000-01-04  3  0.056640 -1.266217  0.571887
2000-01-05  4 -0.711993  0.433433 -1.233371
2000-01-06  5 -1.479888  0.522521 -0.456433
2000-01-07  6 -0.916996 -0.402383  1.753993
2000-01-08  7  0.971987 -1.265242 -0.801794

In [29]:
dfa['A'] = list(range(len(dfa.index)))

In [30]:
dfa

            A         B         C         D
2000-01-01  0 -0.104215  0.128062  0.487910
2000-01-02  1  0.938386 -0.396542  0.171286
2000-01-03  2  0.626929  0.108056  1.691873
2000-01-04  3  0.056640 -1.266217  0.571887
2000-01-05  4 -0.711993  0.433433 -1.233371
2000-01-06  5 -1.479888  0.522521 -0.456433
2000-01-07  6 -0.916996 -0.402383  1.753993
2000-01-08  7  0.971987 -1.265242 -0.801794

In [32]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]}, index = list('abc'))
x

   x  y
a  1  3
b  2  4
c  3  5

In [43]:
x.iloc[1][['x','y']] = [5, 55]

In [44]:
x

   x   y
a  1   3
b  5  55
c  3   5

In [45]:
df = pd.DataFrame({'one': [1., 2., 3.]})

In [48]:
df['two'] = [4, 5, 6]

In [49]:
df

   one  two
0  1.0    4
1  2.0    5
2  3.0    6

In [50]:
dfl = pd.DataFrame(np.random.randn(5, 4),
   ....:                    columns=list('ABCD'),
   ....:                    index=pd.date_range('20130101', periods=5))

In [52]:
dfl

                   A         B         C         D
2013-01-01  0.545987  0.530640  0.206683 -0.200575
2013-01-02  0.943630  1.265416  2.510516 -0.813103
2013-01-03 -0.333846  0.756279 -1.280533  0.247948
2013-01-04  0.217356 -0.568300  0.124519 -0.525931
2013-01-05  1.341756  1.752547 -0.683174  1.488790

In [55]:
dfl.loc['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.943630  1.265416  2.510516 -0.813103
2013-01-03 -0.333846  0.756279 -1.280533  0.247948
2013-01-04  0.217356 -0.568300  0.124519 -0.525931

In [56]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))

In [57]:
s1

a    1.218058
b   -1.185647
c    1.381287
d   -0.477770
e   -1.399040
f    1.205030
dtype: float64

In [58]:
s1.loc['c']

1.3812872627873116

In [59]:
s1.c

1.3812872627873116

In [60]:
s1.loc['b']

-1.1856473650407977

In [61]:
s1.loc['c'] = 0

In [62]:
s1

a    1.218058
b   -1.185647
c    0.000000
d   -0.477770
e   -1.399040
f    1.205030
dtype: float64

In [63]:
s1.iloc[1] = -2

In [64]:
s1

a    1.218058
b   -2.000000
c    0.000000
d   -0.477770
e   -1.399040
f    1.205030
dtype: float64

In [65]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))

In [66]:
df1

          A         B         C         D
a  1.410001 -1.407243  0.020050 -0.990343
b  0.702819 -0.567070  0.720305  0.330806
c -1.118610 -0.013547 -2.005248  0.056493
d -0.628303 -0.325771 -0.353246 -1.624098
e -0.825857 -0.465416 -1.087265  0.006717
f  0.367230  0.900824 -0.104930 -1.215246

In [67]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a  1.410001 -1.407243  0.020050 -0.990343
b  0.702819 -0.567070  0.720305  0.330806
d -0.628303 -0.325771 -0.353246 -1.624098

In [72]:
df1.iloc[0:3][['B', 'C']]

          B         C
a -1.407243  0.020050
b -0.567070  0.720305
c -0.013547 -2.005248

In [75]:
df1.loc['d', 'A']

-0.6283031859993905

In [78]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))
s1

0   -1.327014
2   -0.850916
4    0.474778
6   -1.258071
8    0.989384
dtype: float64

In [80]:
s1.iloc[:3]

0   -1.327014
2   -0.850916
4    0.474778
dtype: float64

In [81]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list(range(0, 12, 2)),
   ....:                    columns=list(range(0, 8, 2)))

In [82]:
df1

           0         2         4         6
0   2.448000 -1.003456  0.304907  1.595348
2  -0.195818 -0.601161  0.909900 -0.022357
4  -0.825858  1.463187  0.581338  0.139925
6  -0.844620  0.900671  0.067345  0.372654
8   0.567510  1.333406 -0.274921 -0.636948
10  0.164895 -1.758145 -0.873064  0.204098

In [83]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))

In [85]:
df1.loc[lambda df: df.A >0, :]

          A         B         C         D
c  0.637755 -0.097723 -0.921113 -1.045817
d  0.091367 -3.645524 -1.210798  0.231909
f  1.134161 -1.570991 -0.384710  0.204410

In [88]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [89]:
s.loc[[1,2,3]]

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

1    2.0
2    3.0
3    NaN
dtype: float64

In [91]:
s.reindex([1,2,'b'])

1    2.0
2    3.0
b    NaN
dtype: float64

In [92]:
s = pd.Series([0, 1, 2, 3, 4, 5])

In [93]:
s.sample(n=6, replace=False)

1    1
3    3
0    0
2    2
5    5
4    4
dtype: int64

In [94]:
s.sample(n=6, replace=True)

1    1
4    4
5    5
3    3
1    1
3    3
dtype: int64

In [95]:
s = pd.Series([0, 1, 2, 3, 4, 5])

In [96]:
example_weights = [0, 0, 0.2, 0.2, 0.2, 0.4]

In [97]:
s.sample(n=3, weights=example_weights)

5    5
4    4
3    3
dtype: int64

In [99]:
s = pd.Series(range(-3, 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [100]:
s[s>0]

4    1
5    2
6    3
dtype: int64

In [102]:
s[(s < -1) |
  (s > 0.5)]

0   -3
1   -2
4    1
5    2
6    3
dtype: int64

In [103]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
   .....:                     'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
   .....:                     'c': np.random.randn(7)})
df2

       a  b         c
0    one  x -0.777173
1    one  y  2.215620
2    two  y  0.455108
3  three  x -0.975138
4    two  y -0.619737
5    one  x -0.064819
6    six  x  0.648471

In [104]:
criterion = df2['a'].map(lambda x: x.startswith('t'))
criterion

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: a, dtype: bool

In [105]:
df2[criterion]

       a  b         c
2    two  y  0.455108
3  three  x -0.975138
4    two  y -0.619737

In [106]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')

In [107]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [110]:
s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

In [109]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [111]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
   .....:                    'ids2': ['a', 'n', 'c', 'n']})

In [112]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [113]:
values = ['a', 'b', 1, 3]

In [114]:
values

['a', 'b', 1, 3]

In [116]:
df[df.isin(values)]

   vals  ids ids2
0   1.0    a    a
1   NaN    b  NaN
2   3.0  NaN  NaN
3   NaN  NaN  NaN

In [120]:
values = {'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}
values

{'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}

In [118]:
row_mask = df.isin(values).all(1)

In [119]:
df[row_mask]

   vals ids ids2
0     1   a    a

In [121]:
df2 = df.copy()
df2

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [123]:
df3 = pd.DataFrame({'A': [1, 2, 3],
   .....:                     'B': [4, 5, 6],
   .....:                     'C': [7, 8, 9]})
   .....: 
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [125]:
s.where(s >= 0)

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [126]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64